app/views/users/show.html.erb

SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 1046959424], ["LIMIT", 1]]
---
    <%= render 'follow_form' if logged_in? %>
    <% if @person.microposts.any? %>