app/controllers/password_resets_controller.rb

  def create
    @person = User.find_by(email: params[:password_reset][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]

  def update
    if params[:user][:password].empty?
      @person.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @person.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$h.6tD64oy7WGoe0O3qU0lu9Pa/Z5kHrDq5UBLg1/a8kTtkyeMUO5C"], ["updated_at", 2016-10-21 23:15:37 UTC], ["id", 762146111]]