app/controllers/relationships_controller.rb

  def create
    @person = User.find(params[:followed_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]

  def destroy
    @person = Relationship.find(params[:id]).followed
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]